perf/ping/endurance/endurance.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: RampUp
      duration: 90
      arrivalRate: 5
      rampTo: 200
    - name: Soak
      duration: 180
      arrivalRate: 200

scenarios:
  - name: Ping (/)
    flow:
      - get:
          url: '/ping'